posts/Implicit Rules of `make`.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-07 Sun 00:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Implicit Rules of `make`</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="FreeBirdLjj" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="manifest" href="/site.webmanifest">
<link rel="stylesheet" type="text/css" href="/assets/css/predefined.css" />
<link rel="stylesheet" type="text/css" href="/assets/css/worg.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://freebirdljj.github.io"> UP </a>
 |
 <a accesskey="H" href="https://freebirdljj.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Implicit Rules of `make`</h1>
<p>
<code>make</code> 有一些隐含的（默认的）推导规则，掌握这些隐含规则不仅能帮我们简化 Makefile 的编写，也能避免我们写出的 Makefile 在 <code>make</code> 时出现奇怪的现象。
</p>

<p>
不过在此之前我们需要先了解一下 Makefile 当中的自动化变量，可以极大地方便我们编写 Makefile，让我们更容易写出一些规则的“模板”。
另外，准确说来自动化变量的名称是不包括前面的那个 <code>$</code> 号的，那不过表示对这个自动化变量进行求值，所以下表也没列出（这也意味着 <code>$@</code> 和 <code>$(@)</code> 是等效的）。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">自动化变量</th>
<th scope="col" class="org-left">意义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>@</code></td>
<td class="org-left">目标集合</td>
</tr>

<tr>
<td class="org-left"><code>%</code></td>
<td class="org-left">仅当目标是函数库文件（UNIX下的 .a 文件，Windows下的 .lib 文件）时，其值为依赖文件，否则为空</td>
</tr>

<tr>
<td class="org-left"><code>&lt;</code></td>
<td class="org-left">依赖目标中的第一个目标</td>
</tr>

<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left">所有比目标新的依赖目标的集合，以空格分隔</td>
</tr>

<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left">所有依赖目标的集合（去重），以空格分隔</td>
</tr>

<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left">所有依赖目标的集合（不去重），以空格分隔</td>
</tr>
</tbody>
</table>

<p>
接下来就是各种各样的隐含规则了。
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.c
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CC</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CPPFLAGS</span><span style="color: #4f97d7;">)</span> -c -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span> $<span style="color: #a45bad;">?</span>

<span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.C
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CXX</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CPPFLAGS</span><span style="color: #4f97d7;">)</span> -c -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span> $<span style="color: #a45bad;">?</span>

<span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.CC
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CXX</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CXXFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CPPFLAGS</span><span style="color: #4f97d7;">)</span> -c -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span> $<span style="color: #a45bad;">?</span>

<span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.p
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">PC</span><span style="color: #4f97d7;">)</span> -c $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">PFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.f
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FC</span><span style="color: #4f97d7;">)</span> -c $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.f</span>: %.F
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FC</span><span style="color: #4f97d7;">)</span> -F $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CPPFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.f</span>: %.r
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FC</span><span style="color: #4f97d7;">)</span> -F $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">RFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.F
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FC</span><span style="color: #4f97d7;">)</span> -c $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CPPFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.r
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FC</span><span style="color: #4f97d7;">)</span> -c $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">FFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">RFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.sym</span>: %.def
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">M2C</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">M2FLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">DEFFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.mod
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">M2C</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">M2FLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">MODFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.o</span>: %.s
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">AS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">ASFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.s</span>: %.S
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CC</span><span style="color: #4f97d7;">)</span> -E $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CPPFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> &gt; <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%</span>: %.o
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CC</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">LDFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">LOADLIBES</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">LDLIBS</span><span style="color: #4f97d7;">)</span> -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>

<span style="color: #bc6ec5; font-weight: bold;">%.c</span>: %.y
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">YACC</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">YFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #a45bad;">?</span>
        mv -f y.tab.c %@

<span style="color: #bc6ec5; font-weight: bold;">%.c</span>: %.l
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">LEX</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">LFLAGS</span><span style="color: #4f97d7;">)</span> -t $<span style="color: #a45bad;">?</span> &gt; <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span>
</pre>
</div>

<p>
最后再说一个小技巧，如果某目标依赖某文件，但在编译该目标的时候又不需要编译器编译该依赖文件（比如某目标 <code>foo.o</code> 依赖 <code>bar.h</code> ，但是编译 <code>foo.o</code> 的时候其实是不用将 <code>bar.h</code> 写到编译命令里的，但如果不在依赖关系里写出的话，更新了 <code>bar.h</code> 又不能 <code>make</code> 时自行重新编译 <code>foo.c</code> ），可以考虑这么做：
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #bc6ec5; font-weight: bold;">foo.o</span>: foo.c bar.h
        $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CC</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CFLAGS</span><span style="color: #4f97d7;">)</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">CPPFLAGS</span><span style="color: #4f97d7;">)</span> -c -o <span style="color: #bc6ec5; font-weight: bold;">$</span><span style="color: #a45bad; font-weight: bold;">@</span> $<span style="color: #4f97d7;">(</span><span style="color: #7590db;">*F</span><span style="color: #4f97d7;">)</span>.c
</pre>
</div>
</div>
</body>
</html>
